import { Col } from '@/shared/ui/boxes';
import { Typography } from '@mui/material';

export const PolicyMain = () => {
    return (
        <Col gap={2}>
            <Typography fontWeight={700} fontSize={32}>
                ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ
            </Typography>

            <Typography>
                Настоящее пользовательское соглашение (далее — «Соглашение») разработано в соответствии со статьями 428,
                435, 437 и 1286 Гражданского кодекса Российской Федерации и является официальным предложением (офертой)
                администрации сайта anti-scamer.ru (далее — «Администрация») в адрес любого дееспособного лица,
                выразившего готовность пользоваться сайтом (далее — «Пользователь») на изложенных ниже условиях.
            </Typography>

            <Typography>
                Факт использования сайта означает полное и безоговорочное принятие Пользователем условий настоящего
                Соглашения.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                1. ТЕРМИНЫ И ОПРЕДЕЛЕНИЯ
            </Typography>

            <Typography>
                Сайт — совокупность веб-страниц, размещённых в сети Интернет по адресу https://anti-scamer.ru,
                администрируемых Администрацией и предназначенных для публикации информационных материалов, направленных
                на предупреждение мошенничества и правовое просвещение пользователей.
            </Typography>

            <Typography>
                Администрация — лицо, обладающее исключительными правами на Сайт и осуществляющее его сопровождение,
                управление и организацию взаимодействия с Пользователями.
            </Typography>

            <Typography>
                Пользователь — любое дееспособное физическое лицо, получающее доступ к Сайту и использующее его
                функциональные возможности.
            </Typography>

            <Typography>
                Контент — любые материалы, размещённые на Сайте: тексты, изображения, комментарии, публикации, обзоры и
                иная информация.
            </Typography>

            <Typography>
                Пользовательский контент — любые материалы, размещённые Пользователем на Сайте, включая комментарии и
                жалобы, размещённые через формы обратной связи или чат.
            </Typography>

            <Typography>
                Жалоба — форма обратной связи, направленная через JivoChat или почту anti-scamer@onionmail.org, с целью
                сообщить о потенциально мошеннических действиях, недостоверной информации, нарушении законов или о
                проблемах в работе Сайта.
            </Typography>

            <Typography>
                JivoChat — сервис онлайн-чата, интегрированный в Сайт и предоставляющий возможность обратной связи между
                Пользователем и Администрацией.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                2. ПРЕДМЕТ СОГЛАШЕНИЯ
            </Typography>

            <Typography>
                2.1. Администрация предоставляет Пользователю доступ к Сайту и размещённым на нём материалам
                исключительно в информационных целях, без создания договорных, агентских, трудовых или иных
                правоотношений.
            </Typography>

            <Typography>
                2.2. Использование Сайта осуществляется Пользователем без регистрации, исключительно для личных,
                ознакомительных и некоммерческих целей.
            </Typography>

            <Typography>
                2.3. Пользователь может направлять обратную связь, оставлять комментарии, а также жалобы на проекты,
                представленные на Сайте.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                3. ПРАВА И ОБЯЗАННОСТИ СТОРОН
            </Typography>

            <Typography fontWeight={500}>3.1. Права Пользователя:</Typography>
            <Typography>
                – свободно получать доступ к материалам, размещённым на Сайте; – направлять жалобы через чат или почту
                по фактам нарушений; – оставлять комментарии, при условии соблюдения законодательства и настоящего
                Соглашения.
            </Typography>

            <Typography fontWeight={500}>3.2. Обязанности Пользователя:</Typography>
            <Typography>
                – не использовать Сайт с целью распространения ложной, клеветнической, агрессивной или незаконной
                информации; – не размещать рекламные, провокационные и вредоносные материалы; – соблюдать нормы
                действующего законодательства Российской Федерации; – уважать права и интересы третьих лиц и
                Администрации.
            </Typography>

            <Typography fontWeight={500}>3.3. Права Администрации:</Typography>
            <Typography>
                – изменять структуру, содержание и правила использования Сайта без уведомления; – блокировать или
                удалять пользовательские комментарии, нарушающие настоящее Соглашение; – ограничивать доступ к Сайту в
                случае злоупотреблений или нарушений условий.
            </Typography>

            <Typography fontWeight={500}>3.4. Обязанности Администрации:</Typography>
            <Typography>
                – обеспечить функциональность Сайта в разумных пределах; – обрабатывать жалобы, направленные через чат
                или электронную почту, в разумные сроки; – не разглашать информацию о Пользователе, за исключением
                случаев, предусмотренных законодательством.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                4. ИНТЕЛЛЕКТУАЛЬНАЯ СОБСТВЕННОСТЬ
            </Typography>

            <Typography>
                4.1. Все материалы, размещённые на Сайте, являются объектами авторского права Администрации и охраняются
                в соответствии с Гражданским кодексом РФ и международными соглашениями.
            </Typography>

            <Typography>
                4.2. Пользователь не вправе копировать, распространять, воспроизводить, публиковать, передавать или иным
                способом использовать материалы Сайта без письменного разрешения Администрации.
            </Typography>

            <Typography>
                4.3. Размещение Пользователем комментариев или жалоб на Сайте означает безвозмездную передачу
                Администрации неисключительных прав на использование этих материалов в рамках функционала Сайта и
                связанных с ним проектов.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                5. КОНФИДЕНЦИАЛЬНОСТЬ И ОБРАБОТКА СООБЩЕНИЙ
            </Typography>

            <Typography>
                5.1. Сайт не осуществляет сбор и обработку персональных данных в смысле Федерального закона №152-ФЗ, за
                исключением тех данных, которые Пользователь добровольно сообщает через чат или электронную почту.
            </Typography>

            <Typography>
                5.2. Администрация не несёт ответственности за достоверность сведений, предоставленных Пользователем.
            </Typography>

            <Typography>
                5.3. Все жалобы, поданные через электронную почту или чат, могут быть использованы Администрацией для
                аналитических или редакционных целей без раскрытия личности отправителя, если иное не указано в явной
                форме.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                6. ОГРАНИЧЕНИЕ ОТВЕТСТВЕННОСТИ
            </Typography>

            <Typography>6.1. Сайт носит исключительно информационный характер.</Typography>

            <Typography>
                6.2. Администрация не несёт ответственности за любые убытки, причинённые в результате использования
                Сайта, в том числе в случае недостоверности или неточности представленной информации.
            </Typography>

            <Typography>
                6.3. Администрация не несёт ответственности за содержание сторонних ресурсов, на которые могут
                содержаться ссылки на Сайте.
            </Typography>

            <Typography>
                6.4. Все действия, совершаемые Пользователем в связи с информацией, размещённой на Сайте, осуществляются
                им добровольно и под его личную ответственность.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                7. ПОДАЧА ЖАЛОБ
            </Typography>

            <Typography>
                7.1. Пользователь вправе направить жалобу на конкретный проект или публикацию, представленную на Сайте
                или в сети Интернет, через:
            </Typography>
            <Typography>– JivoChat на страницах сайта; – почту: anti-scamer@onionmail.org.</Typography>

            <Typography>
                7.2. Администрация рассматривает жалобы по существу в течение разумного срока, однако не обязуется
                предоставлять официальный ответ, если сообщение: – не содержит конкретных сведений; – оформлено в
                ненадлежащей форме (оскорбления, угрозы, нецензурная лексика); – нарушает положения настоящего
                Соглашения.
            </Typography>

            <Typography fontWeight={500} fontSize={21}>
                8. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ
            </Typography>

            <Typography>
                8.1. Настоящее Соглашение вступает в силу с момента начала использования Сайта Пользователем.
            </Typography>

            <Typography>
                8.2. Администрация вправе в любое время вносить изменения в Соглашение. Новая редакция считается
                действующей с момента публикации на Сайте.
            </Typography>

            <Typography>
                8.3. Использование Сайта после публикации новой редакции Соглашения считается согласием Пользователя с
                её условиями.
            </Typography>

            <Typography>
                8.4. К настоящему Соглашению и отношениям сторон применяется законодательство Российской Федерации.
            </Typography>

            <Typography>
                8.5. Все возможные споры, возникающие из настоящего Соглашения, подлежат разрешению в порядке,
                установленном действующим законодательством РФ, с обязательным досудебным урегулированием через
                обращение по электронной почте anti-scamer@onionmail.org.
            </Typography>
        </Col>
    );
};
